results/iterations/redis_4kb_latency_iter1.txt
====== SET ======
  1000000 requests completed in 11.11 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.103 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 678487)
75.000% <= 0.295 milliseconds (cumulative count 873723)
87.500% <= 0.303 milliseconds (cumulative count 955712)
96.875% <= 0.311 milliseconds (cumulative count 979647)
98.438% <= 0.319 milliseconds (cumulative count 986541)
99.219% <= 0.343 milliseconds (cumulative count 992428)
99.609% <= 0.383 milliseconds (cumulative count 996416)
99.805% <= 0.423 milliseconds (cumulative count 998164)
99.902% <= 0.471 milliseconds (cumulative count 999152)
99.951% <= 0.487 milliseconds (cumulative count 999566)
99.976% <= 0.527 milliseconds (cumulative count 999762)
99.988% <= 0.703 milliseconds (cumulative count 999879)
99.994% <= 1.487 milliseconds (cumulative count 999939)
99.997% <= 9.159 milliseconds (cumulative count 999970)
99.998% <= 9.439 milliseconds (cumulative count 999985)
99.999% <= 9.623 milliseconds (cumulative count 999993)
100.000% <= 9.695 milliseconds (cumulative count 999997)
100.000% <= 9.735 milliseconds (cumulative count 999999)
100.000% <= 9.751 milliseconds (cumulative count 1000000)
100.000% <= 9.751 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 1)
0.005% <= 0.207 milliseconds (cumulative count 46)
95.571% <= 0.303 milliseconds (cumulative count 955712)
99.774% <= 0.407 milliseconds (cumulative count 997744)
99.972% <= 0.503 milliseconds (cumulative count 999720)
99.984% <= 0.607 milliseconds (cumulative count 999841)
99.988% <= 0.703 milliseconds (cumulative count 999879)
99.990% <= 0.807 milliseconds (cumulative count 999903)
99.991% <= 0.903 milliseconds (cumulative count 999908)
99.991% <= 1.007 milliseconds (cumulative count 999914)
99.992% <= 1.103 milliseconds (cumulative count 999921)
99.993% <= 1.207 milliseconds (cumulative count 999928)
99.993% <= 1.303 milliseconds (cumulative count 999931)
99.993% <= 1.407 milliseconds (cumulative count 999935)
99.994% <= 1.503 milliseconds (cumulative count 999939)
99.994% <= 1.607 milliseconds (cumulative count 999944)
99.995% <= 1.703 milliseconds (cumulative count 999948)
99.995% <= 1.807 milliseconds (cumulative count 999950)
99.997% <= 9.103 milliseconds (cumulative count 999966)
100.000% <= 10.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 90041.42 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.284     0.096     0.287     0.303     0.335     9.751
====== GET ======
  1000000 requests completed in 11.24 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.103 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 591062)
75.000% <= 0.295 milliseconds (cumulative count 805312)
87.500% <= 0.303 milliseconds (cumulative count 914085)
93.750% <= 0.311 milliseconds (cumulative count 954536)
96.875% <= 0.319 milliseconds (cumulative count 969021)
98.438% <= 0.351 milliseconds (cumulative count 986167)
99.219% <= 0.383 milliseconds (cumulative count 992244)
99.609% <= 0.431 milliseconds (cumulative count 996234)
99.805% <= 0.479 milliseconds (cumulative count 998475)
99.902% <= 0.495 milliseconds (cumulative count 999112)
99.951% <= 0.519 milliseconds (cumulative count 999570)
99.976% <= 0.551 milliseconds (cumulative count 999759)
99.988% <= 0.583 milliseconds (cumulative count 999890)
99.994% <= 0.623 milliseconds (cumulative count 999939)
99.997% <= 0.687 milliseconds (cumulative count 999975)
99.998% <= 0.703 milliseconds (cumulative count 999989)
99.999% <= 0.719 milliseconds (cumulative count 999996)
100.000% <= 0.727 milliseconds (cumulative count 999999)
100.000% <= 0.735 milliseconds (cumulative count 1000000)
100.000% <= 0.735 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 1)
0.002% <= 0.207 milliseconds (cumulative count 15)
91.409% <= 0.303 milliseconds (cumulative count 914085)
99.455% <= 0.407 milliseconds (cumulative count 994551)
99.936% <= 0.503 milliseconds (cumulative count 999361)
99.993% <= 0.607 milliseconds (cumulative count 999930)
99.999% <= 0.703 milliseconds (cumulative count 999989)
100.000% <= 0.807 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 88944.23 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.288     0.096     0.287     0.311     0.367     0.735