results/iterations/redis_4kb_latency_iter10.txt
====== SET ======
  1000000 requests completed in 11.30 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.127 milliseconds (cumulative count 2)
50.000% <= 0.295 milliseconds (cumulative count 756368)
87.500% <= 0.303 milliseconds (cumulative count 918441)
93.750% <= 0.311 milliseconds (cumulative count 975006)
98.438% <= 0.319 milliseconds (cumulative count 989736)
99.219% <= 0.327 milliseconds (cumulative count 993908)
99.609% <= 0.343 milliseconds (cumulative count 996107)
99.805% <= 0.415 milliseconds (cumulative count 998057)
99.902% <= 0.479 milliseconds (cumulative count 999326)
99.951% <= 0.487 milliseconds (cumulative count 999643)
99.976% <= 0.495 milliseconds (cumulative count 999826)
99.988% <= 0.503 milliseconds (cumulative count 999918)
99.994% <= 0.511 milliseconds (cumulative count 999943)
99.997% <= 0.695 milliseconds (cumulative count 999970)
99.998% <= 0.799 milliseconds (cumulative count 999985)
99.999% <= 0.847 milliseconds (cumulative count 999993)
100.000% <= 0.871 milliseconds (cumulative count 999997)
100.000% <= 0.887 milliseconds (cumulative count 1000000)
100.000% <= 0.887 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.002% <= 0.207 milliseconds (cumulative count 17)
91.844% <= 0.303 milliseconds (cumulative count 918441)
99.791% <= 0.407 milliseconds (cumulative count 997913)
99.992% <= 0.503 milliseconds (cumulative count 999918)
99.996% <= 0.607 milliseconds (cumulative count 999959)
99.997% <= 0.703 milliseconds (cumulative count 999972)
99.999% <= 0.807 milliseconds (cumulative count 999987)
100.000% <= 0.903 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 88487.75 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.289     0.120     0.295     0.311     0.327     0.887
====== GET ======
  1000000 requests completed in 11.43 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.103 milliseconds (cumulative count 1)
50.000% <= 0.295 milliseconds (cumulative count 677042)
75.000% <= 0.303 milliseconds (cumulative count 842147)
87.500% <= 0.311 milliseconds (cumulative count 922247)
93.750% <= 0.319 milliseconds (cumulative count 954924)
96.875% <= 0.327 milliseconds (cumulative count 969941)
98.438% <= 0.351 milliseconds (cumulative count 984765)
99.219% <= 0.399 milliseconds (cumulative count 992544)
99.609% <= 0.463 milliseconds (cumulative count 996219)
99.805% <= 0.511 milliseconds (cumulative count 998276)
99.902% <= 0.567 milliseconds (cumulative count 999049)
99.951% <= 0.591 milliseconds (cumulative count 999542)
99.976% <= 0.607 milliseconds (cumulative count 999771)
99.988% <= 0.647 milliseconds (cumulative count 999889)
99.994% <= 0.687 milliseconds (cumulative count 999949)
99.997% <= 0.703 milliseconds (cumulative count 999971)
99.998% <= 0.719 milliseconds (cumulative count 999986)
99.999% <= 0.791 milliseconds (cumulative count 999993)
100.000% <= 0.863 milliseconds (cumulative count 999997)
100.000% <= 0.911 milliseconds (cumulative count 999999)
100.000% <= 0.959 milliseconds (cumulative count 1000000)
100.000% <= 0.959 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 1)
0.002% <= 0.207 milliseconds (cumulative count 15)
84.215% <= 0.303 milliseconds (cumulative count 842147)
99.339% <= 0.407 milliseconds (cumulative count 993388)
99.801% <= 0.503 milliseconds (cumulative count 998010)
99.977% <= 0.607 milliseconds (cumulative count 999771)
99.997% <= 0.703 milliseconds (cumulative count 999971)
99.999% <= 0.807 milliseconds (cumulative count 999993)
100.000% <= 0.903 milliseconds (cumulative count 999998)
100.000% <= 1.007 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 87466.11 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.293     0.096     0.295     0.319     0.383     0.959