results/iterations/redis_4kb_latency_iter2.txt
====== SET ======
  1000000 requests completed in 11.30 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.119 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 578112)
75.000% <= 0.295 milliseconds (cumulative count 770199)
87.500% <= 0.311 milliseconds (cumulative count 919710)
93.750% <= 0.319 milliseconds (cumulative count 942671)
96.875% <= 0.343 milliseconds (cumulative count 973586)
98.438% <= 0.375 milliseconds (cumulative count 985822)
99.219% <= 0.415 milliseconds (cumulative count 992519)
99.609% <= 0.479 milliseconds (cumulative count 996107)
99.805% <= 0.543 milliseconds (cumulative count 998101)
99.902% <= 0.615 milliseconds (cumulative count 999083)
99.951% <= 0.655 milliseconds (cumulative count 999516)
99.976% <= 0.767 milliseconds (cumulative count 999763)
99.988% <= 0.967 milliseconds (cumulative count 999878)
99.994% <= 1.183 milliseconds (cumulative count 999940)
99.997% <= 1.359 milliseconds (cumulative count 999970)
99.998% <= 1.535 milliseconds (cumulative count 999985)
99.999% <= 1.759 milliseconds (cumulative count 999993)
100.000% <= 1.887 milliseconds (cumulative count 999997)
100.000% <= 1.943 milliseconds (cumulative count 999999)
100.000% <= 1.999 milliseconds (cumulative count 1000000)
100.000% <= 1.999 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.003% <= 0.207 milliseconds (cumulative count 29)
87.400% <= 0.303 milliseconds (cumulative count 873999)
99.167% <= 0.407 milliseconds (cumulative count 991666)
99.700% <= 0.503 milliseconds (cumulative count 997001)
99.894% <= 0.607 milliseconds (cumulative count 998941)
99.965% <= 0.703 milliseconds (cumulative count 999654)
99.980% <= 0.807 milliseconds (cumulative count 999804)
99.986% <= 0.903 milliseconds (cumulative count 999857)
99.989% <= 1.007 milliseconds (cumulative count 999888)
99.992% <= 1.103 milliseconds (cumulative count 999915)
99.995% <= 1.207 milliseconds (cumulative count 999946)
99.996% <= 1.303 milliseconds (cumulative count 999965)
99.997% <= 1.407 milliseconds (cumulative count 999973)
99.998% <= 1.503 milliseconds (cumulative count 999982)
99.999% <= 1.607 milliseconds (cumulative count 999987)
99.999% <= 1.703 milliseconds (cumulative count 999991)
99.999% <= 1.807 milliseconds (cumulative count 999994)
100.000% <= 1.903 milliseconds (cumulative count 999997)
100.000% <= 2.007 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 88519.08 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.289     0.112     0.287     0.327     0.399     1.999
====== GET ======
  1000000 requests completed in 11.20 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.119 milliseconds (cumulative count 1)
50.000% <= 0.287 milliseconds (cumulative count 633688)
75.000% <= 0.295 milliseconds (cumulative count 835662)
87.500% <= 0.303 milliseconds (cumulative count 931962)
93.750% <= 0.311 milliseconds (cumulative count 965938)
96.875% <= 0.319 milliseconds (cumulative count 977401)
98.438% <= 0.335 milliseconds (cumulative count 985012)
99.219% <= 0.391 milliseconds (cumulative count 992236)
99.609% <= 0.463 milliseconds (cumulative count 996177)
99.805% <= 0.519 milliseconds (cumulative count 998058)
99.902% <= 0.559 milliseconds (cumulative count 999068)
99.951% <= 0.583 milliseconds (cumulative count 999585)
99.976% <= 0.599 milliseconds (cumulative count 999822)
99.988% <= 0.607 milliseconds (cumulative count 999902)
99.994% <= 0.623 milliseconds (cumulative count 999953)
99.997% <= 0.647 milliseconds (cumulative count 999972)
99.998% <= 0.751 milliseconds (cumulative count 999985)
99.999% <= 0.879 milliseconds (cumulative count 999993)
100.000% <= 1.023 milliseconds (cumulative count 999997)
100.000% <= 1.111 milliseconds (cumulative count 999999)
100.000% <= 1.167 milliseconds (cumulative count 1000000)
100.000% <= 1.167 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.002% <= 0.207 milliseconds (cumulative count 16)
93.196% <= 0.303 milliseconds (cumulative count 931962)
99.359% <= 0.407 milliseconds (cumulative count 993593)
99.772% <= 0.503 milliseconds (cumulative count 997717)
99.990% <= 0.607 milliseconds (cumulative count 999902)
99.998% <= 0.703 milliseconds (cumulative count 999981)
99.999% <= 0.807 milliseconds (cumulative count 999988)
99.999% <= 0.903 milliseconds (cumulative count 999993)
100.000% <= 1.007 milliseconds (cumulative count 999996)
100.000% <= 1.103 milliseconds (cumulative count 999998)
100.000% <= 1.207 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 89277.74 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.286     0.112     0.287     0.311     0.375     1.167